//============================================================================
//文件名称：SPI.h
//功能概要：SPI头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2015-12-27      V1.0
//============================================================================

#ifndef _SPI_H_
#define _SPI_H_


//1 头文件
#include "common.h"
#include "printf.h"
//#include <MK64F12.h>
//2 宏定义
//定义SPI口号
#define SPI_0 0
#define SPI_1 1
#define SPI_2 2
#define FSL_SIM_SCGC_BIT(SCGCx, n) (((SCGCx-1U)<<5U) + n)
//定义主从机模式
enum spimode
{
	MASTER,    //主机模式
	SLAVE     //主机模式
};

#define TRANSFER_BAUDRATE (500000U) /*! Transfer baudrate - 500k */
//SPI对于的IRQ中断号
#define SPI0IRQ 0
#define SPI1IRQ 1
#define SPI2IRQ 2


#define CPOL_0 0
#define CPOL_1 1
#define CPHA_0 0
#define CPHA_1 1
//===========================================================================
//函数名称：SPI_init。
//功能说明：SPI初始化
//函数参数：spiNo：模块号，取值为0、1
//       spiMode spiMode主从机模式配置
//函数返回：无
//===========================================================================
void spi_init(uint8_t spiNo,uint8_t spiMode,uint8_t CPOL,uint8_t CPHA);

//=========================================================================
//函数名称：spi_send1
//函数参数：spiNo：SPI通道号。
//       data[]：需要发送的数据。
//函数返回：无
//功能概要：SPI发送数据。
//=========================================================================
void SPI_send1(uint_8 spiNo,uint_16 data);

//==============================================================================
//函数名称：SPI_send1_slave
//功能说明：SPI发送一字节数据。
//函数参数：SPI_No：模块号。 其取值为0或1
//       data：     需要发送的一字节数据。
//函数返回：0：发送失败；1：发送成功。
//==============================================================================
void SPI_send1_slave(uint8_t spiNo,uint16_t data);
//=========================================================================
//函数名称：spi_re
//函数参数：spiNo：SPI通道号。
//       *data接收到数据存放处
//函数返回：0：成功 1：失败
//功能概要：SPI接收数据。
//=========================================================================
uint8_t spi_recieve1(uint8_t spiNo,uint16_t* data);

//=========================================================================
//函数名称：hw_spi_enable_re_int
//参数说明：spiNo: SPI号
//函数返回： 无
//功能概要：开SPI接收中断
//=========================================================================
void spi_enable_re_int(uint8_t spiNo);

//=========================================================================
//函数名称：spi_disable_re_int
//参数说明：spiNo: SPI号
//函数返回： 无
//功能概要：关SPI接收中断
//=========================================================================
void spi_disable_re_int(uint8_t spiNo);


//=========================================================================
//函数名称：spi_get_base_address
//函数参数：spiNo：SPI通道号
//函数返回：无
//功能概要：将SPI通道号转换成对应基指针。
//=========================================================================
SPI_MemMapPtr spi_get_base_address(uint8_t spiNo);

#endif /* 05_DRIVER_KEL_SPI_SPI_H_ */
